Autodesk.Revit.DB.FaceAPIUtils.GetFaceEdgesAsCurveLoops(Autodesk.Revit.DB.Face)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FaceAPIUtils.FaceXFaceIntersectWithResult(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Curve@)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FaceAPIUtils.FaceXFaceIntersect(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Face)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null